/************************************
文件功能：自定义函数存放
库要求：主函数中已定义：
		#include <reg52.h>
应用函数：

修改历史：
		   	 ‘修改人’   ‘修改内容’  ‘修改时间’
			    ATIME	增加函数	2014-04-29
					增加interrupt_serial2(void)	
最后修改时间：2017-01-30
作者： ATIME	版权所有
常见错误解释：
***************************************/

#ifndef _ATIME_APP_C_ 
#define _ATIME_APP_C_

/************************************
全局变量组
***************************************/


/************************************
函数功能：猫起立
传递参数：空
返回值：空	
注意：空
***************************************/
void cat_up(void)
{

}

/************************************
函数功能：猫回去
传递参数：空
返回值：空	
注意：空
***************************************/
void cat_back(void)
{

}

/************************************
函数功能：猫藏起来
传递参数：空
返回值：空	
注意：空
***************************************/
void cat_hide(void)
{

}


/************************************
函数功能：伸手关闭1
传递参数：空
返回值：空	
注意：空
***************************************/
void close_switch1(void)
{

}


/************************************
函数功能：伸手关闭2
传递参数：空
返回值：空	
注意：空
***************************************/
void close_switch2(void)
{

}

/************************************
函数功能：伸手关闭3
传递参数：空
返回值：空	
注意：空
***************************************/
void close_switch3(void)
{

}



/************************************
函数功能：伸手关闭4
传递参数：空
返回值：空	
注意：空
***************************************/
void close_switch4(void)
{

}

#endif